benchmarks/runpod_h200sxm/benchmark_results_gpt_oss_120b_h200sxm/benchmark_gpt_oss_120b_h200sxm_run_1_TP8_DP1_CTX15000_C100_P100_O128.txt
BENCHMARK: benchmark_gpt_oss_120b_h200sxm_run_1_TP8_DP1_CTX15000_C100_P100_O128
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7eb69c907e20>, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=15000, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=100, model='Scicom-intl/gpt-oss-120b-Malaysian-Reasoning-SFT-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='./benchmark_results_gpt_oss_120b_h200sxm', result_filename='benchmark_gpt_oss_120b_h200sxm_run_1_TP8_DP1_CTX15000_C100_P100_O128.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-05a581c8-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 01-28 04:40:01 [datasets.py:612] Sampling input_len from [15000, 15000] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 100

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:09<15:03,  9.13s/it]
  7%|▋         | 7/100 [00:09<01:30,  1.03it/s]
 16%|█▌        | 16/100 [00:09<00:28,  2.94it/s]
 24%|██▍       | 24/100 [00:09<00:14,  5.23it/s]
 32%|███▏      | 32/100 [00:09<00:08,  8.26it/s]
 42%|████▏     | 42/100 [00:09<00:04, 13.23it/s]
 51%|█████     | 51/100 [00:09<00:02, 18.71it/s]
 62%|██████▏   | 62/100 [00:09<00:01, 26.95it/s]
 74%|███████▍  | 74/100 [00:09<00:00, 37.43it/s]
 88%|████████▊ | 88/100 [00:10<00:00, 51.84it/s]
100%|██████████| 100/100 [00:10<00:00,  9.86it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             100       
Benchmark duration (s):                  10.14     
Total input tokens:                      1500000   
Total generated tokens:                  12800     
Request throughput (req/s):              9.86      
Output token throughput (tok/s):         1261.73   
Peak output token throughput (tok/s):    4932.00   
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          149120.16 
---------------Time to First Token----------------
Mean TTFT (ms):                          4364.82   
Median TTFT (ms):                        4378.95   
P99 TTFT (ms):                           8371.11   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          41.93     
Median TPOT (ms):                        42.16     
P99 TPOT (ms):                           68.51     
---------------Inter-token Latency----------------
Mean ITL (ms):                           41.93     
Median ITL (ms):                         15.71     
P99 ITL (ms):                            104.27    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          9690.48   
Median E2EL (ms):                        9733.09   
P99 E2EL (ms):                           10079.23  
==================================================