benchmarks/runpod_h200sxm/benchmark_results_gpt_oss_120b_h200sxm/benchmark_gpt_oss_120b_h200sxm_run_1_TP8_DP1_CTX4096_C100_P100_O128.txt
BENCHMARK: benchmark_gpt_oss_120b_h200sxm_run_1_TP8_DP1_CTX4096_C100_P100_O128
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x73e60cbf7e20>, seed=0, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=100, model='Scicom-intl/gpt-oss-120b-Malaysian-Reasoning-SFT-v0.1', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=False, append_result=False, metadata=None, result_dir='./benchmark_results_gpt_oss_120b_h200sxm', result_filename='benchmark_gpt_oss_120b_h200sxm_run_1_TP8_DP1_CTX4096_C100_P100_O128.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-d3015b63-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 01-28 04:39:27 [datasets.py:612] Sampling input_len from [4096, 4096] and output_len from [128, 128]
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 100

  0%|          | 0/100 [00:00<?, ?it/s]
  1%|          | 1/100 [00:03<05:55,  3.60s/it]
  2%|▏         | 2/100 [00:03<02:44,  1.68s/it]
 29%|██▉       | 29/100 [00:04<00:05, 13.40it/s]
 65%|██████▌   | 65/100 [00:04<00:00, 35.25it/s]
100%|██████████| 100/100 [00:04<00:00, 23.78it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             100       
Benchmark duration (s):                  4.21      
Total input tokens:                      409600    
Total generated tokens:                  12800     
Request throughput (req/s):              23.78     
Output token throughput (tok/s):         3043.24   
Peak output token throughput (tok/s):    7064.00   
Peak concurrent requests:                100.00    
Total token throughput (tok/s):          100426.77 
---------------Time to First Token----------------
Mean TTFT (ms):                          1406.98   
Median TTFT (ms):                        1409.74   
P99 TTFT (ms):                           2492.74   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          20.99     
Median TPOT (ms):                        21.07     
P99 TPOT (ms):                           28.71     
---------------Inter-token Latency----------------
Mean ITL (ms):                           21.01     
Median ITL (ms):                         13.97     
P99 ITL (ms):                            92.77     
----------------End-to-end Latency----------------
Mean E2EL (ms):                          4073.26   
Median E2EL (ms):                        4085.01   
P99 E2EL (ms):                           4175.07   
==================================================